'use client';
import type { ReactNode } from 'react';
import styled from 'styled-components';

const Main = styled.main`
  flex: 1 0 auto;
`;

const Content = ({ children }: { children: ReactNode }) => {
  return (
    <Main>
      {children}
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p> 
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p> 
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
      <p>Здесь будет контент</p>
    </Main>
  );
};

export default Content;
